app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("webseries_name", "link", "description", "link_to_trailer") VALUES ($1, $2, $3, $4) RETURNING "id"  [["webseries_name", "qqqqq"], ["link", "wwww"], ["description", "rrrrrr"], ["link_to_trailer", "eeee"]]